os/sample-report/20081152xxx.org
#+TITLE:    《操作系统原理》实验报告
#+AUTHOR:    姓名(学号)
#+EMAIL:     
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+STYLE: <link rel="stylesheet" type="text/css" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" />
#+STYLE: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 
# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

#+BEGIN_CENTER 
  Don't forget to answer the sum up questions in your email message!
#+END_CENTER 

* Approaching to the Linux kernel
** 实验内容
   - [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2]]
** 实验步骤及思考题
*** proc file-system
**** Questions
    1. What's the CPU type and model? =/proc/cpuinfo=
       : less /proc/cpuinfo
       : model name      : Intel(R) Core(TM)2 Duo CPU     T6570  @ 2.10GHz
    2. What version of the Linux kernel are you using? =uname=
       : uname -a	
       : Linux debian 3.0.0-1-amd64
    3. How long has it been since your PC last booted? =uptime=
       : 
    4. How much of the total CPU time has been spent executing in user mode? kernel mode? idle? =top=
       : 
    5. How much memory is configured in your PC? =top,free,/proc/meminfo=
       : 
    6. How much memory is currently available? =top,free,/proc/meminfo=
       : 
    7. How many disk read/write requests have been made? =/proc/diskstats=
       : 
    8. How many context switches has the kernel performed? =/proc/stat=
       : 
    9. How many context switches has a process had? =/proc/[pid]/status=
       : 
    10. How many processes have been created since the system was booted? =/proc/stat=
	: 
    11. How many processes are there in the ready queue? =/proc/stat=
	: 
    12. How many processes are blocked waiting for I/O to complete? =/proc/stat=
  	: 
    13. What does the following command do?
	: cd /proc/`ps | head -2 | tail -1 | cut -f1 -d' '` && ls -l

**** Sum up
     In your /email message/, please answer the following questions.
     1. How many hours you spent in this section?
	- 
     2. What's the major difficulties you met in this section? 
	1. 
	2. 
	3. 
     3. How did you solve (or try solving) them?
	- 
     4. Have you learnt anything? Or your time was just wasted?
	- 
*** Play with the kernel
    - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-2]] 
    - 实验环境 :: 
      - OS version: (=uname -srv=)
      - Kernel source version: (=ls /usr/src/=)  
      - GCC version: (=gcc -v | tail -1=)
**** 实验步骤
     1. 实
     2. 验
     3. 步
     4. 骤
**** Sum up
     In your email message, please answer the following questions.
     1. How many hours you spent in this section?
	- 
     2. What's the major difficulties you met in this section? 
	1. 
	2. 
	3. 
     3. How did you solve (or try solving) them?
	- 
     4. Have you learnt anything? Or your time was just wasted?
	- 

*** Hello, kernel Module!
    - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-3]] 
    - 实验环境 :: 
      - OS version: (=uname -srv=)
      - Kernel source version: (=ls /usr/src/=)  
      - GCC version: (=gcc -v | tail -1=)
**** 实验步骤
     1. 实
     2. 验
     3. 步
     4. 骤
**** Questions
     1. What's a kernel module?
     2. How do modules get into the kernel?
     3. How do you know a kernel module is loaded?
     4. How do you know a module is working properly or not?
     5. How do you unload a module?
     6. What's the major problems you met in this section? And how did you solve (or try solving) them?

**** Sum up
     In your email message, please answer the following questions.
     1. How many hours you spent in this section?
	- 
     2. What's the major difficulties you met in this section? 
	1. 
	2. 
	3. 
     3. How did you solve (or try solving) them?
	- 
     4. Have you learnt anything? Or your time was just wasted?
	- 

*** System calls
    - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-4]]  
    - 实验环境 :: 
      - OS version: (=uname -srv=)
      - Kernel source version: (=ls /usr/src/=)  
      - GCC version: (=gcc -v | tail -1=)
**** 实验步骤
     1. 实
     2. 验
     3. 步
     4. 骤
**** Sum up
     In your email message, please answer the following questions.
     1. How many hours you spent in this section?
	- 
     2. What's the major difficulties you met in this section? 
	1. 
	2. 
	3. 
     3. How did you solve (or try solving) them?
	- 
     4. Have you learnt anything? Or your time was just wasted?
	- 

* Process management
  - [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3]]
** Process creation
   - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-1-1]]
   - 实验环境 :: 
     - OS version: (=uname -srv=)
     - Kernel source version: (=ls /usr/src/=)  
     - GCC version: (=gcc -v | tail -1=)
*** 实验步骤
    1. 实
    2. 验
    3. 步
    4. 骤
*** Sum up
    In your email message, please answer the following questions.
    1. How many hours you spent in this section?
       - 
    2. What's the major difficulties you met in this section? 
       1. 
       2. 
       3. 
    3. How did you solve (or try solving) them?
       - 
    4. Have you learnt anything? Or your time was just wasted?
       - 

** Thread
   - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-2]]
   - 实验环境 :: 
     - OS version: (=uname -srv=)
     - Kernel source version: (=ls /usr/src/=)  
     - GCC version: (=gcc -v | tail -1=)
*** 实验步骤
    1. 实
    2. 验
    3. 步
    4. 骤
*** Sum up
    In your email message, please answer the following questions.
    1. How many hours you spent in this section?
       - 
    2. What's the major difficulties you met in this section? 
       1. 
       2. 
       3. 
    3. How did you solve (or try solving) them?
       - 
    4. Have you learnt anything? Or your time was just wasted?
       - 

** IPC
   - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-3]]
   - 实验环境 :: 
     - OS version: (=uname -srv=)
     - Kernel source version: (=ls /usr/src/=)  
     - GCC version: (=gcc -v | tail -1=)
*** 实验步骤
    1. 实
    2. 验
    3. 步
    4. 骤
*** Sum up
    In your email message, please answer the following questions.
    1. How many hours you spent in this section?
       - 
    2. What's the major difficulties you met in this section? 
       1. 
       2. 
       3. 
    3. How did you solve (or try solving) them?
       - 
    4. Have you learnt anything? Or your time was just wasted?
       - 

* Memory management
  - [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4]]
** Basic commands
   - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-1]]
   - 实验环境 :: 
     - OS version: (=uname -srv=)
     - Kernel source version: (=ls /usr/src/=)  
     - GCC version: (=gcc -v | tail -1=)
*** 实验步骤
    1. 实
    2. 验
    3. 步
    4. 骤
** Shared Memory Segments
   - 实验内容 :: [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-2]]
   - 实验环境 :: 
     - OS version: (=uname -srv=)
     - Kernel source version: (=ls /usr/src/=)  
     - GCC version: (=gcc -v | tail -1=)
*** 实验步骤
    1. 实
    2. 验
    3. 步
    4. 骤
** Memory Mapped Files
   - 实验内容 :: http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-3
   - 实验环境 :: 
     - OS version: (=uname -srv=)
     - Kernel source version: (=ls /usr/src/=)  
     - GCC version: (=gcc -v | tail -1=)
*** 实验步骤
    1. 实
    2. 验
    3. 步
    4. 骤
*** Sum up
    In your email message, please answer the following questions.
    1. How many hours you spent in this section?
       - 
    2. What's the major difficulties you met in this section? 
       1. 
       2. 
       3. 
    3. How did you solve (or try solving) them?
       - 
    4. Have you learnt anything? Or your time was just wasted?
       - 

* File system
  - *实验内容* http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-5
  - *实验环境* 
    - OS version: (=uname -srv=)
    - Kernel source version: (=ls /usr/src/=)  
    - GCC version: (=gcc -v | tail -1=)
** 实验步骤
   1. 实
   2. 验
   3. 步
   4. 骤
*** Sum up
    In your email message, please answer the following questions.
    1. How many hours you spent in this section?
       - 
    2. What's the major difficulties you met in this section? 
       1. 
       2. 
       3. 
    3. How did you solve (or try solving) them?
       - 
    4. Have you learnt anything? Or your time was just wasted?
       - 
