os/sample-report/20081152xxx.html
<!DOCTYPE html>
<html>
<head>
<title>《操作系统原理》实验报告</title>
<!-- 2015-04-28 Tue 09:35 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="姓名(学号)">
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">《操作系统原理》实验报告</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Approaching to the Linux kernel</a>
<ul>
<li><a href="#sec-1-1">1.1. 实验内容</a></li>
<li><a href="#sec-1-2">1.2. 实验步骤及思考题</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Process management</a>
<ul>
<li><a href="#sec-2-1">2.1. Process creation</a></li>
<li><a href="#sec-2-2">2.2. Thread</a></li>
<li><a href="#sec-2-3">2.3. IPC</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Memory management</a>
<ul>
<li><a href="#sec-3-1">3.1. Basic commands</a></li>
<li><a href="#sec-3-2">3.2. Shared Memory Segments</a></li>
<li><a href="#sec-3-3">3.3. Memory Mapped Files</a></li>
</ul>
</li>
<li><a href="#sec-4">4. File system</a>
<ul>
<li><a href="#sec-4-1">4.1. 实验步骤</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="center">
<p>
Don't forget to answer the sum up questions in your email message!
</p>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Approaching to the Linux kernel</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 实验内容</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 实验步骤及思考题</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> proc file-system</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>Questions<br ><div class="outline-text-5" id="text-1-2-1-1">
<ol class="org-ol">
<li>What's the CPU type and model? <code>/proc/cpuinfo</code>
<pre class="example">
less /proc/cpuinfo
model name      : Intel(R) Core(TM)2 Duo CPU     T6570  @ 2.10GHz
</pre>
</li>
<li>What version of the Linux kernel are you using? <code>uname</code>
<pre class="example">
uname -a        
Linux debian 3.0.0-1-amd64
</pre>
</li>
<li>How long has it been since your PC last booted? <code>uptime</code>
<pre class="example">
</pre>
</li>
<li>How much of the total CPU time has been spent executing in user mode? kernel mode? idle? <code>top</code>
<pre class="example">
</pre>
</li>
<li>How much memory is configured in your PC? <code>top,free,/proc/meminfo</code>
<pre class="example">
</pre>
</li>
<li>How much memory is currently available? <code>top,free,/proc/meminfo</code>
<pre class="example">
</pre>
</li>
<li>How many disk read/write requests have been made? <code>/proc/diskstats</code>
<pre class="example">
</pre>
</li>
<li>How many context switches has the kernel performed? <code>/proc/stat</code>
<pre class="example">
</pre>
</li>
<li>How many context switches has a process had? <code>/proc/[pid]/status</code>
<pre class="example">
</pre>
</li>
<li>How many processes have been created since the system was booted? <code>/proc/stat</code>
<pre class="example">
</pre>
</li>
<li>How many processes are there in the ready queue? <code>/proc/stat</code>
<pre class="example">
</pre>
</li>
<li>How many processes are blocked waiting for I/O to complete? <code>/proc/stat</code>
<pre class="example">
</pre>
</li>
<li>What does the following command do?
<pre class="example">
cd /proc/`ps | head -2 | tail -1 | cut -f1 -d' '` &amp;&amp; ls -l
</pre>
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>Sum up<br ><div class="outline-text-5" id="text-1-2-1-2">
<p>
In your <i>email message</i>, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Play with the kernel</h4>
<div class="outline-text-4" id="text-1-2-2">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-2">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-2</a> 
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>实验步骤<br ><div class="outline-text-5" id="text-1-2-2-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</li>
<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>Sum up<br ><div class="outline-text-5" id="text-1-2-2-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Hello, kernel Module!</h4>
<div class="outline-text-4" id="text-1-2-3">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-3">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-3</a> 
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<ol class="org-ol"><li><a id="sec-1-2-3-1" name="sec-1-2-3-1"></a>实验步骤<br ><div class="outline-text-5" id="text-1-2-3-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</li>
<li><a id="sec-1-2-3-2" name="sec-1-2-3-2"></a>Questions<br ><div class="outline-text-5" id="text-1-2-3-2">
<ol class="org-ol">
<li>What's a kernel module?
</li>
<li>How do modules get into the kernel?
</li>
<li>How do you know a kernel module is loaded?
</li>
<li>How do you know a module is working properly or not?
</li>
<li>How do you unload a module?
</li>
<li>What's the major problems you met in this section? And how did you solve (or try solving) them?
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-3-3" name="sec-1-2-3-3"></a>Sum up<br ><div class="outline-text-5" id="text-1-2-3-3">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> System calls</h4>
<div class="outline-text-4" id="text-1-2-4">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-4">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-2-4</a>  
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<ol class="org-ol"><li><a id="sec-1-2-4-1" name="sec-1-2-4-1"></a>实验步骤<br ><div class="outline-text-5" id="text-1-2-4-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</li>
<li><a id="sec-1-2-4-2" name="sec-1-2-4-2"></a>Sum up<br ><div class="outline-text-5" id="text-1-2-4-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Process management</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3</a>
</li>
</ul>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Process creation</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-1-1">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-1-1</a>
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 实验步骤</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Sum up</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Thread</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-2">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-2</a>
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 实验步骤</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Sum up</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> IPC</h3>
<div class="outline-text-3" id="text-2-3">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-3">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-3-3</a>
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 实验步骤</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Sum up</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Memory management</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4</a>
</li>
</ul>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Basic commands</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-1">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-1</a>
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 实验步骤</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Shared Memory Segments</h3>
<div class="outline-text-3" id="text-3-2">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-2">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-2</a>
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 实验步骤</h4>
<div class="outline-text-4" id="text-3-2-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Memory Mapped Files</h3>
<div class="outline-text-3" id="text-3-3">
<dl class="org-dl">
<dt> 实验内容 </dt><dd><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-3">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-4-3</a>
</dd>
<dt> 实验环境 </dt><dd><ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</dd>
</dl>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> 实验步骤</h4>
<div class="outline-text-4" id="text-3-3-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Sum up</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> File system</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><b>实验内容</b> <a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-5">http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/lab.html#sec-5</a>
</li>
<li><b>实验环境</b> 
<ul class="org-ul">
<li>OS version: (<code>uname -srv</code>)
</li>
<li>Kernel source version: (<code>ls /usr/src/</code>)  
</li>
<li>GCC version: (<code>gcc -v | tail -1</code>)
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 实验步骤</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>实
</li>
<li>验
</li>
<li>步
</li>
<li>骤
</li>
</ol>
</div>
<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Sum up</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>What's the major difficulties you met in this section? 
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
</ol>
</li>
<li>How did you solve (or try solving) them?
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Have you learnt anything? Or your time was just wasted?
<ul class="org-ul">
<li></li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 姓名(学号)</p>
<p class="date">Created: 2015-04-28 Tue 09:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
